console.log('Script connected');

const arrayOfLoveWishes = [
    "Бажаю тобі нескінченної любові та тепла!",
    "Нехай твоє серце завжди буде сповнене ніжності.",
    "Нехай кожен день приносить радість і кохання.",
    "Бажаю, щоб поруч завжди була людина, яка тебе кохає.",
    "Нехай кохання буде чистим, щирим і взаємним.",
    "Нехай у твоєму житті буде багато обіймів і поцілунків.",
    "Бажаю, щоб твоє серце ніколи не знало болю і смутку.",
    "Нехай кохання наповнює кожен твій день яскравими емоціями.",
    "Бажаю вірного і турботливого партнера поруч.",
    "Нехай твоє серце завжди знаходить відгук у іншому серці.",
    "Бажаю, щоб ваше кохання було вічним і міцним.",
    "Нехай твоє життя буде наповнене щасливими моментами з коханою людиною.",
    "Бажаю пристрасних і незабутніх поцілунків.",
    "Нехай твоя любов буде натхненням для нових звершень.",
    "Бажаю романтики і казкових моментів у стосунках.",
    "Нехай ваші серця б’ються в унісон назавжди.",
    "Бажаю, щоб ваше кохання було міцним, як діамант.",
    "Нехай кожен день приносить вам нові причини для щастя разом.",
    "Бажаю багато тепла, розуміння і гармонії у відносинах.",
    "Нехай ваше кохання буде яскравим, як найкрасивіший схід сонця!"
  ];
  

document.getElementById('btn_wishes').addEventListener('click', () =>  {
   console.log('Button clicked');

    let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
    console.log('Номер елементу масиву - ', index);
    document.getElementById('p_wishes').innerText = arrayOfLoveWishes[index];
})